<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"s3","label":"dev","backend":"61071f5665f401e35c9d645c6454dc8c461a413d01ecb8e8694e0e9ae44f2383","plan_job_ref":"Job Pull Request Checks #423 at https://github.com/GSA-TTS/FAC/actions/runs/22147284364","plan_out_hash":"293ecb4fc4bb1d3f54107447a39704241528b5d1eea75d6ecd71883ae9f640ba","plan_hash":"8920a8fff973eef94c200c82ef56c5805d1848be57d73eed51377b3b889772b8","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan for __dev__
<details>
<summary>Plan: 4 to add, 1 to change, 1 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create
!~  update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # module.dev.module.cors.null_resource.cors_header must be replaced
-/+ resource "null_resource" "cors_header" {
!~      id       = "*******************" -> (known after apply)
!~      triggers = { # forces replacement
!~          "always_run" = "2026-02-18T16:00:12Z" -> (known after apply)
        }
    }

  # module.dev.module.metabase-app.data.cloudfoundry_domain.public will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_domain" "public" {
+       annotations         = (known after apply)
+       created_at          = (known after apply)
+       id                  = (known after apply)
+       internal            = (known after apply)
+       labels              = (known after apply)
+       name                = "app.cloud.gov"
+       org                 = (known after apply)
+       router_group        = (known after apply)
+       shared_orgs         = (known after apply)
+       supported_protocols = (known after apply)
+       updated_at          = (known after apply)
    }

  # module.dev.module.metabase-app.data.cloudfoundry_org.app_org will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "cloudfoundry_org" "app_org" {
+       annotations = (known after apply)
+       created_at  = (known after apply)
+       id          = (known after apply)
+       labels      = (known after apply)
+       name        = "gsa-tts-oros-fac"
+       quota       = (known after apply)
+       suspended   = (known after apply)
+       updated_at  = (known after apply)
    }

  # module.dev.module.metabase-app.data.cloudfoundry_space.app_space will be read during apply
  # (config refers to values not yet known)
 <= data "cloudfoundry_space" "app_space" {
+       allow_ssh         = (known after apply)
+       annotations       = (known after apply)
+       created_at        = (known after apply)
+       id                = (known after apply)
+       isolation_segment = (known after apply)
+       labels            = (known after apply)
+       name              = "dev"
+       org               = (known after apply)
+       quota             = (known after apply)
+       updated_at        = (known after apply)
    }

  # module.dev.module.metabase-app.data.docker_registry_image.metabase will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "docker_registry_image" "metabase" {
+       id            = (known after apply)
+       name          = "metabase/metabase:latest"
+       sha256_digest = (known after apply)
    }

  # module.dev.module.metabase-app.cloudfoundry_app.metabase will be created
+   resource "cloudfoundry_app" "metabase" {
+       buildpacks                  = (known after apply)
+       command                     = <<-EOT
            MB_DB_CONNECTION_URI=$(echo "$VCAP_SERVICES" | grep -o '"uri":\s*"[^"]*' | sed 's/"uri":\s*//' | cut -d '"' -f2 | tail -1)
            export MB_DB_CONNECTION_URI
            
            ./app/run_metabase.sh
        EOT
+       created_at                  = (known after apply)
+       disk_quota                  = "3072M"
+       docker_image                = (known after apply)
+       enable_ssh                  = (known after apply)
+       environment                 = {
+           "ENV"                = "dev"
+           "REQUESTS_CA_BUNDLE" = "/etc/ssl/certs/ca-certificates.crt"
+           "SSL_CERT_FILE"      = "/etc/ssl/certs/ca-certificates.crt"
        }
+       health_check_http_endpoint  = "/api/health"
+       health_check_type           = "http"
+       id                          = (known after apply)
+       instances                   = 1
+       log_rate_limit_per_second   = (known after apply)
+       memory                      = "2048M"
+       name                        = "metabase"
+       org_name                    = "gsa-tts-oros-fac"
+       readiness_health_check_type = (known after apply)
+       routes                      = (known after apply)
+       service_bindings            = [
+           {
+               params           = jsonencode({})
+               service_instance = "fac-db"
            },
+           {
+               params           = jsonencode({})
+               service_instance = "https-proxy-creds"
            },
+           {
+               params           = jsonencode({})
+               service_instance = "metabase-db"
            },
        ]
+       space_name                  = "dev"
+       stack                       = (known after apply)
+       strategy                    = "rolling"
+       updated_at                  = (known after apply)
    }

  # module.dev.module.metabase-app.cloudfoundry_route.app_route will be created
+   resource "cloudfoundry_route" "app_route" {
+       created_at   = (known after apply)
+       destinations = [
+           {
+               app_id           = (known after apply)
+               app_process_type = (known after apply)
+               id               = (known after apply)
+               port             = (known after apply)
+               protocol         = (known after apply)
            },
        ]
+       domain       = (known after apply)
+       host         = "metabase-dev"
+       id           = (known after apply)
+       protocol     = (known after apply)
+       space        = (known after apply)
+       updated_at   = (known after apply)
+       url          = (known after apply)
    }

  # module.dev.module.metabasedb.cloudfoundry_service_instance.rds[0] will be created
+   resource "cloudfoundry_service_instance" "rds" {
+       created_at        = (known after apply)
+       dashboard_url     = (known after apply)
+       id                = (known after apply)
+       last_operation    = (known after apply)
+       maintenance_info  = (known after apply)
+       name              = "metabase-db"
+       parameters        = (sensitive value)
+       service_plan      = "815c6069-289a-4444-ba99-40f0fa03a8f5"
+       space             = "06525ba3-19c2-451b-96e9-ea4a9134e8b9"
+       tags              = [
+           "rds",
+           "terraform-cloudgov-managed",
        ]
+       type              = "managed"
+       updated_at        = (known after apply)
+       upgrade_available = (known after apply)
    }

  # module.dev.module.newrelic.newrelic_nrql_alert_condition.http_500_errors will be updated in-place
!~  resource "newrelic_nrql_alert_condition" "http_500_errors" {
-       description                    = <<-EOT
            Application is experiencing 500 errors. 
            
            To investigate run this query: 
            
            FROM Transaction 
            SELECT name, duration, request.uri, response.status 
            WHERE response.status = '500' 
            AND appName = 'gsa-fac-dev' 
            SINCE 10 minutes ago
        EOT -> null
        id                             = "4900037:58210045"
        name                           = "HTTP 500 Errors Detected"
#        (18 unchanged attributes hidden)

#        (2 unchanged blocks hidden)
    }

Plan: 4 to add, 1 to change, 1 to destroy.
```
</details>

:memo: Plan generated in [Pull Request Checks #423](https://github.com/GSA-TTS/FAC/actions/runs/22147284364)